In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
data = pd.read_csv('Social_Network_Ads.csv')
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          1
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          1
4  15804002    Male   19            76000          0

In [3]:
data

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          1
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          1
4  15804002    Male   19            76000          0
5  15728773    Male   27            58000          0
6  15598044  Female   27            84000          0
7  15694829  Female   32           150000          1
8  15600575    Male   25            33000          0
9  15727311  Female   35            65000          1

In [10]:
data.shape

(10, 5)

1. Can I say Purchased is dependent on the salary of the user?
2. Can I say that Purchased is dependent on the Age of the user?
3. Can I say that Purchased is dependent on the Gender of the user?

- Conclusion : Purchased variable is dependent on all other variables in the data.
- Purchased is the target variable (dependent variable) in the data

- The data type of Purchased variable is object. Hence, it is a classification problem

- UserID, Gender, Age, Salary all are independent variables 
- Purchased is the dependent variable.

## Seperate the data into Independent(X) and dependent variable(y)

In [4]:
X = data.drop('Purchased', axis = 1)
y = data['Purchased']

In [5]:
X

    User ID  Gender  Age  EstimatedSalary
0  15624510    Male   19            19000
1  15810944    Male   35            20000
2  15668575  Female   26            43000
3  15603246  Female   27            57000
4  15804002    Male   19            76000
5  15728773    Male   27            58000
6  15598044  Female   27            84000
7  15694829  Female   32           150000
8  15600575    Male   25            33000
9  15727311  Female   35            65000

In [6]:
y

0    0
1    1
2    0
3    1
4    0
5    0
6    0
7    1
8    0
9    1
Name: Purchased, dtype: int64

## Split the data into train and test set

In [7]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2)

In [8]:
X_train

    User ID  Gender  Age  EstimatedSalary
7  15694829  Female   32           150000
5  15728773    Male   27            58000
8  15600575    Male   25            33000
3  15603246  Female   27            57000
2  15668575  Female   26            43000
0  15624510    Male   19            19000
4  15804002    Male   19            76000
1  15810944    Male   35            20000

In [13]:
data

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          1
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          1
4  15804002    Male   19            76000          0
5  15728773    Male   27            58000          0
6  15598044  Female   27            84000          0
7  15694829  Female   32           150000          1
8  15600575    Male   25            33000          0
9  15727311  Female   35            65000          1

In [9]:
X_test

    User ID  Gender  Age  EstimatedSalary
6  15598044  Female   27            84000
9  15727311  Female   35            65000

In [11]:
y_train

7    1
5    0
8    0
3    1
2    0
0    0
4    0
1    1
Name: Purchased, dtype: int64

In [12]:
y_test

6    0
9    1
Name: Purchased, dtype: int64

## The idea of a train test split is train set should always greater than test set
- 80% -train and 20 % test
- 70% train and 30% test
- 90% train and 10% test
- 75% train and 25% test

In [14]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2)

In [15]:
X_train

    User ID  Gender  Age  EstimatedSalary
1  15810944    Male   35            20000
5  15728773    Male   27            58000
8  15600575    Male   25            33000
3  15603246  Female   27            57000
9  15727311  Female   35            65000
6  15598044  Female   27            84000
7  15694829  Female   32           150000
4  15804002    Male   19            76000

In [16]:
X_test

    User ID  Gender  Age  EstimatedSalary
0  15624510    Male   19            19000
2  15668575  Female   26            43000

## Note: 
- The rows are randomly selected into train and test set
- Every execution changes the train set and test set
- In order to stabilize the train and test set you have to use the random_state parameter in train_test_split function

In [23]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

In [24]:
X_train

    User ID  Gender  Age  EstimatedSalary
4  15804002    Male   19            76000
9  15727311  Female   35            65000
1  15810944    Male   35            20000
6  15598044  Female   27            84000
7  15694829  Female   32           150000
3  15603246  Female   27            57000
0  15624510    Male   19            19000
5  15728773    Male   27            58000

In [25]:
X_test

    User ID  Gender  Age  EstimatedSalary
2  15668575  Female   26            43000
8  15600575    Male   25            33000

## Machine Learning Process

## Step 1 : Import all necessary libraries

In [27]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

## Step 2 : Load the data

## Step 3 : Data Cleaning, Data Wrangling, Data Preprocessing

## Step 4 : Seperate X and y

In [ ]:
X = data.drop('target column name', axis = 1)
y = data['target column name']

## Step 5 : Split the data into train and test sets

In [26]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

## Step 6 : Apply ML model on X_train and y_train

## Step 7 : Predict on X_test and store the results in y_pred

## Step 8 : Evaluate y_pred and y_test to get the accuracy of ML model